'''
Έστω ένας πίνακας με Ν αριθμούς. Σχεδιάστε και αναλύστε έναν αλγόριθμο που να βρίσκει την ελάχιστη
απόσταση μεταξύ δύο οποιονδήποτε στοιχείων. Για παράδειγμα, στον πίνακα [10, 0, 6, -4, 20, -8, 2] η
ελάχιστη διαφορά είναι 2 (μεταξύ των 0 και 2). Ο αλγόριθμός σας θα πρέπει να έχει μικρότερη
πολυπλοκότητα από Ο(n^2).
'''

def min_sum(L):
    L.sort() # O(nlogn)
    min_sum = int(10**20)
    for i in range(len(L)-1):
        if L[i+1]-L[i]<min_sum:
            min_sum = L[i+1]-L[i] #O(n)
    return min_sum

print(min_sum([10, 0, 6, -4, 20, -8, 2]))